[
    {
        "id": 1,
        "title": "AI DEV AGENT",
        "img": "project/AIDevAgent.png",
        "link": "https://botaidev.azurewebsites.net/",
        "ghLink": "https://github.com/amankrs21/AI-DEV-AGENT",
        "description": "An AI-powered developer assistant that analyzes, debugs, and updates code with deep project awareness. Built using Mistral, Langchain, Transformers, and Pickle, it acts like an autonomous pair programmer capable of understanding and improving entire repositories."
    },
    {
        "id": 2,
        "title": "GenAI RAG BOT",
        "img": "project/rag-bot.png",
        "link": "https://ragbot.pages.dev/",
        "ghLink": "https://github.com/amankrs21/GenAI-RAG-Bot",
        "description": "Generative AI Assistant built with Retrieval-Augmented Generation (RAG) architecture using FastAPI, ChromaDB, LangChain, Mistral, Cohere Embeddings, Pickle, Session Management. This bot answers domain-specific queries using a vector store."
    },
    {
        "id": 3,
        "title": "FineTune-LLM",
        "img": "project/fine-tune.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/FineTune-LLM",
        "description": "FineTune-LLM is a Generative AI tool for fine-tuning large language models using custom datasets with Hugging Face Transformers, Datasets, PEFT, LoRA, and DeepSpeed. It simplifies training, evaluation, and deployment of tailored LLMs for domain-specific tasks."
    },
    {
        "id": 4,
        "title": "Article Analyzer-NLP",
        "img": "project/nlp.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/ArticleAnalyzer-NLP",
        "description": "A Python-based NLP project that scrapes articles from given URLs, analyzes their sentiment and readability metrics, and exports the results to an Excel file. It utilizes BeautifulSoup for web scraping, TextBlob for sentiment analysis, and Flesch-Kincaid for readability scoring."
    },
    {
        "id": 5,
        "title": "Secure Vault",
        "img": "project/SecureVault.png",
        "link": "https://securevault.pages.dev/",
        "ghLink": "https://github.com/amankrs21/Secure-Vault",
        "description": "A secure vault for passwords and notes, built with the MERN stack. Features JWT-based auth, PIN-protected encryption, and E2E data safety—ensuring only you can access your private info in a sleek, secure, and user-first experience. 🔐🛡️"
    },
    {
        "id": 6,
        "title": "Retro Sphere",
        "img": "project/RetroSphere.png",
        "link": "https://retro-sphere.pages.dev/",
        "ghLink": "https://github.com/amankrs21/Retro-Sphere",
        "description": "A real-time retro board for agile teams. It lets team members share feedback, emotions, and appreciation post-sprint. WebSocket-powered, interactive, and designed to foster engagement during sprint retrospectives in a fun, collaborative way."
    },
    {
        "id": 7,
        "title": "Reactify Hub",
        "img": "project/ReactifyHub.png",
        "link": "https://reactify-hub.pages.dev/",
        "ghLink": "https://github.com/amankrs21/Reactify-Hub",
        "description": "A collection of mini React apps built into Reactify Hub—featuring weather, password validation, calculator, BMI, and todos. Each tool showcases refined React concepts like state, props, and hooks in a clean, interactive, and responsive UI."
    },
    {
        "id": 8,
        "title": "My Portfolio",
        "img": "project/Portfolio.png",
        "link": "https://amankrs21.pages.dev/",
        "ghLink": "https://github.com/amankrs21/My-Portfolio",
        "description": "A personal portfolio website crafted with React and Tailwind CSS. Features smooth animations, responsive layout, and clean UI to showcase my skills, projects, and aspirations in a modern and accessible format."
    },
    {
        "id": 9,
        "title": "My Portfolio OLD",
        "img": "project/portfolio-old.png",
        "link": "https://amankrs21-old.pages.dev/",
        "ghLink": "https://github.com/amankrs21/My-Portfolio-OLD",
        "description": "A personal portfolio website crafted with React and Tailwind CSS. Features smooth animations, responsive layout, and clean UI to showcase my skills, projects, and aspirations in a modern and accessible format."
    },
    {
        "id": 10,
        "title": "TODO MERN",
        "img": "project/TodoMern.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/TodoMern",
        "description": "A robust todo management app built using the MERN stack. Offers full CRUD, JWT authentication, and protected routes to ensure secure access and task management for authenticated users."
    },
    {
        "id": 11,
        "title": "Todo React Django",
        "img": "project/TodoReactDjango.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/TodoReactDjango",
        "description": "A todo app built with React and Django. It includes JWT authentication, Material UI components, and seamless user interactions—combining frontend dynamism with a stable backend architecture."
    },
    {
        "id": 12,
        "title": "Todo Angular Dotnet",
        "img": "project/TodoAngularNet.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/TodoAngularNet",
        "description": "Full-stack todo application using Angular and Dotnet C#. Includes JWT-based authentication and CRUD features. Offers a structured and secure platform for managing daily tasks with type-safe backend handling."
    },
    {
        "id": 13,
        "title": "Finance",
        "img": "project/Finance.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/FinanceReactDjango",
        "description": "A finance portfolio website for a finance firm. Built with React and Django, it supports user authentication, blogs, contact forms, payment gateway integration, and interactive charts to showcase service data and financial metrics."
    },
    {
        "id": 14,
        "title": "Angular Todo",
        "img": "project/AngularTodo.png",
        "link": "https://angulartodo.pages.dev/",
        "ghLink": "https://github.com/amankrs21/AngularTodo",
        "description": "A lightweight Angular SPA for managing todos using local storage. Offers an intuitive interface and persistent data across sessions—perfect for organizing tasks with speed and simplicity."
    }
]