[
    {
        "id": 1,
        "title": "AI DEV AGENT",
        "img": "project/AIDevAgent.png",
        "link": "https://botaidev.azurewebsites.net/",
        "ghLink": "https://github.com/amankrs21/AI-DEV-AGENT",
        "description": "An AI-powered developer assistant that analyzes, debugs, and updates code with deep project awareness. Built using Mistral, Langchain, Transformers, and Pickle, it acts like an autonomous pair programmer capable of understanding and improving entire repositories."
    },
    {
        "id": 2,
        "title": "Secure Vault",
        "img": "project/SecureVault.png",
        "link": "https://securevault.pages.dev/",
        "ghLink": "https://github.com/amankrs21/Secure-Vault",
        "description": "A secure todo management platform built with the MERN stack. Features JWT-based authentication, encrypted data handling, and protected routes—ensuring only verified users can access personal data in a clean, user-friendly interface."
    },
    {
        "id": 3,
        "title": "Retro Sphere",
        "img": "project/RetroSphere.png",
        "link": "https://retro-sphere.pages.dev/",
        "ghLink": "https://github.com/amankrs21/Retro-Sphere",
        "description": "A real-time retro board for agile teams. It lets team members share feedback, emotions, and appreciation post-sprint. WebSocket-powered, interactive, and designed to foster engagement during sprint retrospectives in a fun, collaborative way."
    },
    {
        "id": 4,
        "title": "My Portfolio",
        "img": "project/Portfolio.png",
        "link": "https://amankrs21.pages.dev/",
        "ghLink": "https://github.com/amankrs21/portfolio",
        "description": "A personal portfolio website crafted with React and Tailwind CSS. Features smooth animations, responsive layout, and clean UI to showcase my skills, projects, and aspirations in a modern and accessible format."
    },
    {
        "id": 5,
        "title": "React Experiments",
        "img": "project/ReactExperiments.png",
        "link": "https://reactexperiments.pages.dev/",
        "ghLink": "https://github.com/amankrs21/reactexperiments",
        "description": "A collection of mini React apps including password validator, calculator, BMI calculator, weather app, and todo manager. Each experiment highlights core React concepts like state, props, and form handling in interactive UI setups."
    },
    {
        "id": 6,
        "title": "MERN Todo",
        "img": "project/TodoMern.png",
        "link": "https://todomern.pages.dev",
        "ghLink": "https://github.com/amankrs21/TodoMern",
        "description": "A robust todo management app built using the MERN stack. Offers full CRUD, JWT authentication, and protected routes to ensure secure access and task management for authenticated users."
    },
    {
        "id": 7,
        "title": "Todo React Django",
        "img": "project/TodoReactDjango.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/TodoReactDjango",
        "description": "A todo app built with React and Django. It includes JWT authentication, Material UI components, and seamless user interactions—combining frontend dynamism with a stable backend architecture."
    },
    {
        "id": 8,
        "title": "Todo Angular Dotnet",
        "img": "project/TodoAngularNet.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/TodoAngularNet",
        "description": "Full-stack todo application using Angular and Dotnet C#. Includes JWT-based authentication and CRUD features. Offers a structured and secure platform for managing daily tasks with type-safe backend handling."
    },
    {
        "id": 9,
        "title": "Finance",
        "img": "project/Finance.png",
        "link": null,
        "ghLink": "https://github.com/amankrs21/FinanceReactDjango",
        "description": "A finance portfolio website for a finance firm. Built with React and Django, it supports user authentication, blogs, contact forms, payment gateway integration, and interactive charts to showcase service data and financial metrics."
    },
    {
        "id": 10,
        "title": "Angular Todo",
        "img": "project/AngularTodo.png",
        "link": "https://angulartodo.pages.dev/",
        "ghLink": "https://github.com/amankrs21/AngularTodo",
        "description": "A lightweight Angular SPA for managing todos using local storage. Offers an intuitive interface and persistent data across sessions—perfect for organizing tasks with speed and simplicity."
    }
]